ToyKeeper/anduril/arch/attiny1634.c
// arch/attiny1634.c: attiny85 support functions
// Copyright (C) 2014-2026 Selene ToyKeeper
// SPDX-License-Identifier: GPL-3.0-or-later
#pragma once

#include "arch/attiny1634.h"

////////// clock speed / delay stuff //////////

inline void mcu_clock_speed() {
    // TODO?
    // (or not; clock speed is set by the fuses)
    // attiny1634 datasheet 6.5
    // CLKSR = [OSCRDY, CSTR, CKOUT_IO, SUT, CKSEL3/2/1/0]
    // default 8MHz calibrated internal clock: SUT=0, CKSEL=0b0010
    #if 0
    cli();
    CCP = 0xD8;
    CLKSR = 0b01000010;
    CCP = 0xD8;
    CLKPR = 0;  // CLK / 1 = full speed, 8 MHz
    sei();
    #endif
}

///// clock dividers
inline void clock_prescale_set(uint8_t n) {
    cli();
    // _PROTECTED_WRITE(CLKPR, n);
    CCP = 0xD8;
    CLKPR = n;
    sei();
}

////////// default hw_setup() //////////


////////// ADC voltage / temperature //////////

inline void mcu_set_admux_therm() {
    // put the ADC in temperature mode
    // DS table 19-3, 19-4, internal sensor / 1.1V ref
    // [refs1, refs0, refen, adc0en, mux3, mux2, mux1, mux0]
    // refs=0b10 : internal 1.1V ref
    // mux=0b1110 : internal temperature sensor
    //#define ADMUX_THERM 0b10001110
    ADMUX = ADMUX_THERM;
    // other stuff is already set, so no need to re-set it
}

inline void mcu_set_admux_voltage() {
    // put the ADC in battery voltage measurement mode
    // TODO: avr datasheet references
    #ifdef USE_VOLTAGE_DIVIDER  // 1.1V / pin7
        ADMUX = ADMUX_VOLTAGE_DIVIDER;
        // disable digital input on divider pin to reduce power consumption
        // TODO: this should be in hwdef init, not here
        VOLTAGE_ADC_DIDR |= (1 << VOLTAGE_ADC);
    #else  // VCC / 1.1V reference
        ADMUX = ADMUX_VCC;
        // disable digital input on VCC pin to reduce power consumption
        //VOLTAGE_ADC_DIDR |= (1 << VOLTAGE_ADC);  // FIXME: unsure how to handle for VCC pin
    #endif
    //ACSRA |= (1 << ACD);  // turn off analog comparator to save power
    // ADCSRB: [VDEN, VDPD, -, -, ADLAR, ADTS2, ADTS1, ADTS0]
    ADCSRB = (1 << ADLAR);  // left-adjust, free-running
    //ADCSRB = 0;  // right-adjust, free-running
}

inline void mcu_adc_sleep_mode() {
    set_sleep_mode(SLEEP_MODE_ADC);
}

inline void mcu_adc_start_measurement() {
    // [ADEN, ADSC, ADATE, adif, ADIE, ADPS2, ADPS1, ADPS0]
    ADCSRA = (1 << ADEN)   // enable
           | (1 << ADSC)   // start
           | (1 << ADATE)  // auto-retrigger
           | (1 << ADIE)   // interrupt enable
           | ADC_PRSCL;    // prescale
}

inline void mcu_adc_off() {
    ADCSRA &= ~(1<<ADEN); //ADC off
}

// left-adjusted mode:
inline uint16_t mcu_adc_result() { return ADC; }
//inline uint16_t mcu_adc_result() { return (uint16_t)(ADCL | (ADCH << 8)); }
// right-adjusted mode:
/*
inline uint16_t mcu_adc_result() {
    uint16_t result = (ADCL | (ADCH << 8)) << 6;
    return result;
}
*/

uint8_t mcu_vdd_raw2cooked(uint16_t measurement) {
    // In : 65535 * 1.1 / Vbat
    // Out: uint8_t: Vbat * 50
    // 1.1 = ADC Vref
    // just truncate the 16-bit version
    // (add 0.01V to round up above a 0.02V step boundary)
    uint8_t result = (voltage_raw2cooked16(measurement) + cV16) / 128;
    return result;
}

// fine voltage, 0 to 10.24V in 1/6400th V steps
uint16_t mcu_vdd_raw2cooked16(uint16_t measurement) {
    // In : 65535 * 1.1 / Vbat
    // Out: Vbat * 6400
    // Out: 65535 * (Vbat / 10) / 1.024V
    #ifdef VOLTAGE_CORRECTION_IS_OFFSET
        uint16_t result = ((uint32_t)(1.1 * 4096 * 100 * VOLTAGE_SLOPE)
                           / measurement)
                        + (VOLTAGE_OFFSET * cV16);
    #else
        // voltage correction applies to slope, not offset
        // (nice, but adds ~600 bytes to ROM size)
        uint16_t result = ((uint32_t)(1.1 * 4096 * 100
                             * (VOLTAGE_SLOPE + (3 * VOLTAGE_CORRECTION)))
                           / measurement)
                        + (VOLTAGE_OFFSET * cV16);
    #endif
    return result;
}

uint8_t mcu_vdivider_raw2cooked(uint16_t measurement) {
    // In : 4095 * Vdiv / 1.1V
    // Out: uint8_t: Vbat * 50
    // Vdiv = Vbat / 4.3  (typically)
    // 1.1 = ADC Vref
    // (add 0.01V to round up above a 0.02V step boundary)
    uint8_t result = (voltage_raw2cooked16(measurement) + cV16) / 128;
    return result;
}

uint16_t mcu_vdivider_raw2cooked16(uint16_t measurement) {
    // In : 4095 * Vdiv / 1.1V
    // Out: Vbat * 6400
    // Out: 65535 * (Vbat / 10) / 1.024V
    // Vdiv = Vbat / 4.3  (typically)
    // 1.1 = ADC Vref
    // default slope: 1024
    // default offset: 1
    #ifdef VOLTAGE_CORRECTION_IS_OFFSET
        uint16_t result = ((uint32_t)(measurement) * 473 / VOLTAGE_SLOPE)
                        + (VOLTAGE_OFFSET * cV16);
    #else
        // voltage correction applies to slope, not offset
        // (nice, but makes ROM bigger)
        uint16_t result = ((uint32_t)(measurement) * 473
                           / (VOLTAGE_SLOPE + (-3 * VOLTAGE_CORRECTION)))
                        + (VOLTAGE_OFFSET * cV16);
    #endif
    return result;
}

#define DEVICE_SIGNATURE_TEMP_GAIN 0x2C

inline uint16_t mcu_temp_raw2cooked(uint16_t measurement) {
    uint8_t gain, read_sig = _BV(SPMEN) | _BV(RSIG);
    int8_t offset;

    // convert raw ADC values to calibrated temperature
    // In: ADC raw temperature (16-bit, or left-aligned)
    // Out: Kelvin << 6
    // Precision: 1/64th Kelvin (but noisy)
    // attiny1634 datasheet section 19.12
    asm volatile (
        "ldi r31, 0\n\t"
        "ldi r30, %[gain_addr]\n\t"
        "cli\n\t"
        "out %[spmcsr], %[read_sig]\n\t"
        "lpm %[gain_reg], Z+\n\t"
        "out %[spmcsr], %[read_sig]\n\t"
        "lpm %[offset_reg], Z\n\t"
        "sei\n\t"
        : [gain_reg] "=r"(gain), [offset_reg] "=r"(offset), [read_sig] "+r"(read_sig)
        : [gain_addr] "M"(DEVICE_SIGNATURE_TEMP_GAIN), [spmcsr] "M"(_SFR_IO_ADDR(SPMCSR))
        : "cc", "r30", "r31"
    );
    // avoid 32-bit math by going back to right aligned briefly: saves ~52 bytes
    //  highest reasonable value of measurement is 375<<6 (105 C)
    //  multiply by at most 127 cannot overflow, keep the 128s place
    //  divide by 128 correctly rounding
    //  if gain was >=128, add the original measurement back
    //  add offset, then return to left aligned
    //  must add 2 post (256 pre) for compat because Anduril subtracts 275,
    //   but the value is now in K proper
    measurement >>= 6;
    uint16_t result = (measurement * (gain & 0x7F) + 319) >> 7;
    if (gain & 0x80)
        result += measurement;
    result += (int16_t)offset;
    return result << 6;
}

inline uint8_t mcu_adc_lsb() {
    // left-adjusted mode:
    return (ADCL >> 6) + (ADCH << 2);
    // right-adjusted mode:
    // datasheet 19.13.3.2:
    // "When ADCL is read, the ADC Data Register is not updated
    //  until ADCH is read. ... ADCL must be read first, then ADCH."
    // So... gotta read it even if not needed?
    // (the value doesn't matter here, the lower bits are only used
    //  for generating some random seed data)
    //return ADCL + ADCH;
}


////////// WDT //////////

inline void mcu_wdt_active() {
    wdt_reset();                    // Reset the WDT
    WDTCSR = (1<<WDIE);             // Enable interrupt every 16ms
}

inline void mcu_wdt_standby() {
    wdt_reset();                    // Reset the WDT
    WDTCSR = (1<<WDIE) | STANDBY_TICK_SPEED;
}

inline void mcu_wdt_stop() {
    cli();                // needed because CCP, below
    wdt_reset();          // Reset the WDT
    MCUSR &= ~(1<<WDRF);  // clear watchdog reset flag
    // _PROTECTED_WRITE(WDTCSR, 0);
    CCP = 0xD8;           // enable config changes
    WDTCSR = 0;           // disable and clear all WDT settings
    sei();
}


////////// PCINT - pin change interrupt (e-switch) //////////

inline void mcu_pcint_on() {
    // enable pin change interrupt
    #ifdef SWITCH2_PCIE
    GIMSK |= ((1 << SWITCH_PCIE) | (1 << SWITCH2_PCIE));
    #else
    GIMSK |= (1 << SWITCH_PCIE);
    #endif
}

inline void mcu_pcint_off() {
    // disable all pin-change interrupts
    GIMSK &= ~(1 << SWITCH_PCIE);
}


////////// aux LEDs //////////

#ifdef USE_AUX1_LED
void mcu_set_aux1_power (uint8_t power) {
    // 0/1/2+ = off/low/high
    switch (power) {
        case 0:  // LED off
            AUX1_LED_DDR  &= 0xff ^ (1 << AUX1_LED_PIN);
            AUX1_LED_PUE  &= 0xff ^ (1 << AUX1_LED_PIN);
            AUX1_LED_PORT &= 0xff ^ (1 << AUX1_LED_PIN);
            break;
        case 1:  // LED low
            AUX1_LED_DDR  &= 0xff ^ (1 << AUX1_LED_PIN);
            AUX1_LED_PUE  |= (1 << AUX1_LED_PIN);
            AUX1_LED_PORT |= (1 << AUX1_LED_PIN);
            break;
        default:  // LED high
            AUX1_LED_DDR  |= (1 << AUX1_LED_PIN);
            AUX1_LED_PUE  |= (1 << AUX1_LED_PIN);
            AUX1_LED_PORT |= (1 << AUX1_LED_PIN);
            break;
    }
}
#endif

#ifdef USE_AUXRGB_LEDS
void mcu_set_auxrgb_power (uint8_t value) {
    // value: 0b00BBGGRR
    // each of RR/GG/BB is: 0/1/2 = off/low/high
    // this function is repetitive, but unrolling it made the ROM smaller
    // AND more flexible (can use a different port per pin this way)

    uint8_t lvl;

    // red
    lvl = (value >> (0)) & 0x03;
    switch (lvl) {
        case 0:  // LED off
            AUXRGB_R_DDR  &= 0xff ^ (1 << AUXRGB_R_PIN);
            AUXRGB_R_PUE  &= 0xff ^ (1 << AUXRGB_R_PIN);
            AUXRGB_R_PORT &= 0xff ^ (1 << AUXRGB_R_PIN);
            break;
        case 1:  // LED low
            AUXRGB_R_DDR  &= 0xff ^ (1 << AUXRGB_R_PIN);
            AUXRGB_R_PUE  |= (1 << AUXRGB_R_PIN);
            AUXRGB_R_PORT |= (1 << AUXRGB_R_PIN);
            break;
        default:  // LED high
            AUXRGB_R_DDR  |= (1 << AUXRGB_R_PIN);
            AUXRGB_R_PUE  |= (1 << AUXRGB_R_PIN);
            AUXRGB_R_PORT |= (1 << AUXRGB_R_PIN);
            break;
    }

    // green
    lvl = (value >> (2)) & 0x03;
    switch (lvl) {
        case 0:  // LED off
            AUXRGB_G_DDR  &= 0xff ^ (1 << AUXRGB_G_PIN);
            AUXRGB_G_PUE  &= 0xff ^ (1 << AUXRGB_G_PIN);
            AUXRGB_G_PORT &= 0xff ^ (1 << AUXRGB_G_PIN);
            break;
        case 1:  // LED low
            AUXRGB_G_DDR  &= 0xff ^ (1 << AUXRGB_G_PIN);
            AUXRGB_G_PUE  |= (1 << AUXRGB_G_PIN);
            AUXRGB_G_PORT |= (1 << AUXRGB_G_PIN);
            break;
        default:  // LED high
            AUXRGB_G_DDR  |= (1 << AUXRGB_G_PIN);
            AUXRGB_G_PUE  |= (1 << AUXRGB_G_PIN);
            AUXRGB_G_PORT |= (1 << AUXRGB_G_PIN);
            break;
    }

    // blue
    lvl = (value >> (4)) & 0x03;
    switch (lvl) {
        case 0:  // LED off
            AUXRGB_B_DDR  &= 0xff ^ (1 << AUXRGB_B_PIN);
            AUXRGB_B_PUE  &= 0xff ^ (1 << AUXRGB_B_PIN);
            AUXRGB_B_PORT &= 0xff ^ (1 << AUXRGB_B_PIN);
            break;
        case 1:  // LED low
            AUXRGB_B_DDR  &= 0xff ^ (1 << AUXRGB_B_PIN);
            AUXRGB_B_PUE  |= (1 << AUXRGB_B_PIN);
            AUXRGB_B_PORT |= (1 << AUXRGB_B_PIN);
            break;
        default:  // LED high
            AUXRGB_B_DDR  |= (1 << AUXRGB_B_PIN);
            AUXRGB_B_PUE  |= (1 << AUXRGB_B_PIN);
            AUXRGB_B_PORT |= (1 << AUXRGB_B_PIN);
            break;
    }
}
#endif

////////// misc //////////

void reboot() {
    // put the WDT in hard reset mode, then trigger it
    cli();
    // _PROTECTED_WRITE(WDTCSR, 0b10001000);
    // allow protected configuration changes for next 4 clock cycles
    CCP = 0xD8;  // magic number
    // reset (WDIF + WDE), no WDIE, fastest (16ms) timing (0000)
    // (DS section 8.5.2 and table 8-4)
    WDTCSR = 0b10001000;
    sei();
    wdt_reset();
    while (1) {}
}

inline void prevent_reboot_loop() {
    // prevent WDT from rebooting MCU again
    MCUSR &= ~(1<<WDRF);  // reset status flag
    wdt_disable();  // from avr/wdt.h
}

